000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ВерификацияКлиентовСобытия/ВерификацияКлиентовСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерификацияКлиентовСобытия</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияВерификацииПокупателей</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <comment>Счётчик событий отказа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Нормальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СобытияВерификацииПокупателей/СобытияВерификацииПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияВерификацииПокупателей</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>ОтказПокупателя</name>
  </enumValues>
  <enumValues>
    <name>Отложено</name>
    <comment>Отложено сотрудником магазина</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ВерификацияКлиентовСобытия/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьОтборДинамическихСписков();

КонецПроцедуры

&НаКлиенте	//	LNK 20.10.2017 15:54:18
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Запись.Нормальный = НЕ Запись.Событие = ПредопределенноеЗначение("Перечисление.СобытияВерификацииПокупателей.ОтказПокупателя");

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	УстановитьОтборДинамическихСписков();

КонецПроцедуры

&НаСервере	//	LNK 08.02.2019 15:22:07
Процедура УстановитьОтборДинамическихСписков()

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		ИнформационныеКарты, 
		"ВладелецКарты", 
		Запись.Контрагент, 
		ЗначениеЗаполнено(Запись.Контрагент));

КонецПроцедуры
